import styles from './styles.module.scss';
import Panel, { ItemProps } from '../Panel';

const listItemFAQ: Array<ItemProps> = [
  {
    key: 1,
    label: 'หากต้องการแจ้งเปลี่ยนที่อยู่ในการจัดส่งเอกสารจะต้องดำเนินการอย่างไร ?',
    children: (
      <p className={styles.contentItem}>
        ส่งสำเนาบัตรประชาชน หรือสำเนาบัตรข้าราชการ พร้อมระบุรายละเอียดการแจ้งเปลี่ยนที่อยู่ในการจัดส่งเอกสาร
        และเบอร์ติดต่อ เซ็นสำเนาถูกต้อง ส่งเอกสารเข้ามาทางไปรษณีย์ตามที่อยู่ของบริษัท กรุงไทยธุรกิจ ลีสซิ่ง จำกัด
        (แจ้งเปลี่ยนที่อยู่ในการจัดส่งเอกสาร) เลขที่ 591 อาคารสมัชชาวานิช 2 (UBC II) ชั้น 2 ถนนสุขุมวิท แขวงคลองตันเหนือ
        เขตวัฒนา กรุงเทพฯ 10110 หรือส่งเข้ามาทางอีเมลล์ info_ktbleasing@ktbleasing.co.th
      </p>
    ),
  },
  {
    key: 2,
    label: 'บริการสินเชื่อเกี่ยวกับรถยนต์ของกรุงไทยธุรกิจลีสซิ่งมีอะไรบ้าง ?',
    children: (
      <p className={styles.contentItem}>
        ส่งสำเนาบัตรประชาชน หรือสำเนาบัตรข้าราชการ พร้อมระบุรายละเอียดการแจ้งเปลี่ยนที่อยู่ในการจัดส่งเอกสาร
        และเบอร์ติดต่อ เซ็นสำเนาถูกต้อง ส่งเอกสารเข้ามาทางไปรษณีย์ตามที่อยู่ของบริษัท กรุงไทยธุรกิจ ลีสซิ่ง จำกัด
        (แจ้งเปลี่ยนที่อยู่ในการจัดส่งเอกสาร) เลขที่ 591 อาคารสมัชชาวานิช 2 (UBC II) ชั้น 2 ถนนสุขุมวิท แขวงคลองตันเหนือ
        เขตวัฒนา กรุงเทพฯ 10110 หรือส่งเข้ามาทางอีเมลล์ info_ktbleasing@ktbleasing.co.th
      </p>
    ),
  },
  {
    key: 3,
    label: 'หากสนใจทำสินเชื่อทะเบียนรถยนต์แบบโอนเล่ม ต้องใช้เอกสารในการสมัครมีอะไรบ้าง ?',
    children: (
      <p className={styles.contentItem}>
        ส่งสำเนาบัตรประชาชน หรือสำเนาบัตรข้าราชการ พร้อมระบุรายละเอียดการแจ้งเปลี่ยนที่อยู่ในการจัดส่งเอกสาร
        และเบอร์ติดต่อ เซ็นสำเนาถูกต้อง ส่งเอกสารเข้ามาทางไปรษณีย์ตามที่อยู่ของบริษัท กรุงไทยธุรกิจ ลีสซิ่ง จำกัด
        (แจ้งเปลี่ยนที่อยู่ในการจัดส่งเอกสาร) เลขที่ 591 อาคารสมัชชาวานิช 2 (UBC II) ชั้น 2 ถนนสุขุมวิท แขวงคลองตันเหนือ
        เขตวัฒนา กรุงเทพฯ 10110 หรือส่งเข้ามาทางอีเมลล์ info_ktbleasing@ktbleasing.co.th
      </p>
    ),
  },
  {
    key: 4,
    label: 'สินเชื่อ Refinance รถยนต์ KTC พี่เบิ้ม ผู้สมัครต้องมีคุณสมบัติอะไรบ้าง ?',
    children: (
      <p className={styles.contentItem}>
        ส่งสำเนาบัตรประชาชน หรือสำเนาบัตรข้าราชการ พร้อมระบุรายละเอียดการแจ้งเปลี่ยนที่อยู่ในการจัดส่งเอกสาร
        และเบอร์ติดต่อ เซ็นสำเนาถูกต้อง ส่งเอกสารเข้ามาทางไปรษณีย์ตามที่อยู่ของบริษัท กรุงไทยธุรกิจ ลีสซิ่ง จำกัด
        (แจ้งเปลี่ยนที่อยู่ในการจัดส่งเอกสาร) เลขที่ 591 อาคารสมัชชาวานิช 2 (UBC II) ชั้น 2 ถนนสุขุมวิท แขวงคลองตันเหนือ
        เขตวัฒนา กรุงเทพฯ 10110 หรือส่งเข้ามาทางอีเมลล์ info_ktbleasing@ktbleasing.co.th
      </p>
    ),
  },
];

const ProductFAQ = () => {
  return (
    <div className={styles.faq + ' container mx-auto'}>
      <h2 className={`${styles.headerFQA}`}>คำถามที่พบบ่อย</h2>
      <Panel items={listItemFAQ} />
    </div>
  );
};

export default ProductFAQ;
