import React from 'react';
import './styles.scss';
import Tab, { TabsProps } from '../Tabs';

const items: Array<TabsProps> = [
  {
    label: 'บุคคลธรรมดา',
    key: '1',
    children: (
      <div className=" grid lg:grid-cols-2 md:grid-cols-1 gap-4">
        <div className="box">
          <h2 className="text-title">คุณสมบัติผู้สมัคร</h2>
          <div className="text-content mt-2">
            <ol>
              <li>เป็นผู้ประกอบการสัญชาติไทย อายุ 20 - 65 ปี</li>
              <li> มีผู้ค้ำประกัน อย่างน้อย 1 ท่าน</li>
              <li>ผู้ขอสินเชื่อ และผู้ค้ำประกันไม่เป็นบุคคลล้มละลาย</li>
            </ol>
          </div>
        </div>
        <div className="box">
          <h2 className="text-title"> เอกสารประกอบการสมัคร</h2>
          <div className="text-content">
            <ol>
              <li>สำเนาบัตรประจำตัวประชาชน และสำเนาทะเบียนบ้านของผู้ขอสินเชื่อ ผู้ค้ำประกัน คู่สมรส</li>
              <li>
                ใบอนุญาตประกอบกิจการ/ทะเบียนการค้า หรือ ทะเบียนพาณิชย์ หรือ เอกสารรับรองการดำเนินธุรกิจจากหน่วยงานราชการ
              </li>
              <li>หนังสือรับรองการทำงานพร้อมรับรองเงินเดือน ใบสลิปเงินเดือน และ/หรือ หนังสือรับรองการหักภาษี </li>
              <li>รายการเดินบัญชีธนาคารย้อนหลัง อย่างน้อย 6 เดือน </li>
              <li>เอกสารใช้รับรองราคาทรัพย์สินได้ เช่น ใบเสนอราคา เป็นต้น </li>
              <li>สัญญาว่าจ้าง/สัญญาเช่า/สัญญาซื้อขาย/สัญญาสัมปทาน</li>
              <li>ข้อมูลรายงาน เครดิตบูโร ของผู้ค้ำประกัน (อายุไม่เกิน 1 เดือน)</li>
              <li>สรุปประวัติกิจการ / ผู้บริหาร พร้อมแผนที่/ภาพถ่ายที่ตั้งกิจการ</li>
              <li>
                เอกสารอื่น (ถ้ามี) เช่น หลักฐานการชำระหนี้กับทุกสถาบันการเงินที่กิจการใช้บริการ ย้อนหลัง 3 เดือน ,
                สำเนาบัตรประจำตัวผู้เสียภาษี และหลักฐานการชำระภาษี, กรณีธุรกิจก่อสร้างฯ
                มีเอกสารแสดงการจัดชั้นผู้รับเหมาจากหน่วยงานราชการ{' '}
              </li>
            </ol>
          </div>
        </div>
      </div>
    ),
  },
  {
    key: '2',
    label: 'นิติบุคคล',
    children: (
      <div className=" grid md:grid-cols-2 xs:grid-cols-1 gap-4">
        <div className="box">
          <h2 className="text-title">คุณสมบัติผู้สมัคร</h2>
          <div className="text-content">
            <ol>
              <li>เป็นกิจการที่จดทะเบียนธุรกิจ ทั่วประเทศ (ไม่จำกัดอายุขขั้นต่ำกิจการ / การดำเนินธุรกิจ) </li>
              <li>มีผู้ค้ำประกัน (กรรมการผู้มีอำนาจ) อย่างน้อย 1ท่าน (กรณีบริษัทมหาชนไม่จำเป็นต้องมีผู้ค้ำประกัน) </li>
              <li>ผู้ขอสินเชื่อ และผู้ค้ำประกันไม่เป็นบุคคลล้มละลาย </li>
            </ol>
          </div>
        </div>
        <div className="box">
          <h2 className="text-title"> เอกสารประกอบการสมัคร</h2>
          <div className="text-content mt-2">
            <ol>
              <li>
                หนังสือรับรอง/หนังสือบริคณห์สนธิ/ บัญชีรายชื่อผู้ถือหุ้น (อบจ.5) บัตรประจำตัวประชาชน และ
                ทะเบียนบ้านผู้มีอำนาจลงนาม (ไม่เกิน 3 เดือน) (ผู้ขอสินเชื่อและผู้ค้ำประกัน){' '}
              </li>
              <li>งบการเงินที่ผ่านการตรวจสอบโดยผู้สอบบัญชีรับอนุญาตล่าสุด 3 ปีติดต่อกัน</li>
              <li>รายการเดินบัญชีธนาคารย้อนหลัง อย่างน้อย 6 เดือน </li>
              <li>เอกสารใช้รับรองราคาทรัพย์สินได้ เช่น ใบเสนอราคา เป็นต้น </li>
              <li>ญญาว่าจ้าง/สัญญาเช่า/สัญญาซื้อขาย/สัญญาสัมปทาน </li>
              <li> ข้อมูลรายงาน เครดิตบูโร ของผู้ค้ำประกัน (อายุไม่เกิน 1 เดือน) </li>
              <li>ข้อมูลรายงาน เครดิตบูโร ของผู้ค้ำประกัน (อายุไม่เกิน 1 เดือน)</li>
              <li>สรุปประวัติกิจการ / ผู้บริหาร พร้อมแผนที่/ภาพถ่ายที่ตั้งกิจการ </li>
              <li>
                เอกสารอื่น (ถ้ามี) งบการเงินภายในหรือประมาณการงบการเงิน หรือ กรณีธุรกิจก่อสร้างฯ มีมูลค่างาน Backlog
                รายชื่อลูกหนี้การค้า / เจ้าหนี้การค้าที่เกี่ยวข้องกับธุรกิจ กรณีธุรกิจก่อสร้างฯ
                มีเอกสารแสดงการจัดชั้นผู้รับเหมาจากหน่วยงานราชการ
                รายละเอียดผลการดำเนินงานของบริษัทแม่และหรือฐานะของผู้ค้ำประกัน ใบเสร็จรับชำระเงินกู้ล่าสุด
                วงเงินสินเชื่อที่มีกับสถาบันการเงิน (รวมถึงยอดหนี้)
              </li>
            </ol>
          </div>
        </div>
      </div>
    ),
  },
];
const AppplicationDetail = () => {
  return (
    <section className="appplication-detail">
      <div className="container  flex flex-column  align-center">
        <div className="">
          <h1 className="text-title">รายละเอียดการสมัคร</h1>
        </div>
        <div>
          <Tab items={items} defaultActiveKey="1" className="justify-center mb-14" />
        </div>
      </div>
    </section>
  );
};
export default AppplicationDetail;
