export const itemList = [
  {
    imageUrl: '/assets/images/new-detail-1.png',
    tag: 'ข่าวบริษัท',
    createDate: '15/12/2566',
    description:
      'การเปิดเผยรายการกลางและการคำนวณราคากลางการจัดซื้อจัดจ้างซึ่งมิใช่งานก่อสร้างตารางแสดงวงเงินงบประมาณที่ได้รับจัดสรรและราคากลาง (ราคาอ้างอิง) ในการจัดซื้อจัดจ้างที่มิใช่งานก่อสร้าง',
  },
  {
    imageUrl: 'assets/images/new-detail-2.png',
    tag: 'ข่าวกิจกรรม',
    createDate: '15/12/2566',
    description: 'จัดจ้างบริการด้านงานทะเบียน - บจก. กิจมงคล คาร์ แอนด์ เซอร์วิสเซส',
  },
  {
    imageUrl: '/assets/images/new-detail-1.png',
    tag: 'ประกวดราคาจัดซื้อจัดจ้าง',
    createDate: '15/12/2566',
    description: 'เคทีซีแถลงทิศทางการดำเนินธุรกิจปี 2566',
  },
  {
    imageUrl: 'assets/images/new-detail-2.png',
    tag: 'รายการทรัพย์สินรอขาย',
    createDate: '15/12/2566',
    description:
      'เคทีซีจับมือมาสเตอร์การ์ดกระตุ้นยอดใช้จ่ายช่วงปลายปี มอบโปรแรงให้สมาชิกที่เซ็นทรัลและโรบินสันทั่วประเทศ',
  },
  {
    imageUrl: '/assets/images/new-detail-1.png',
    tag: 'รายการทรัพย์สินรอขาย',
    createDate: '15/12/2566',
    description:
      'เคทีซีจับมือมาสเตอร์การ์ดกระตุ้นยอดใช้จ่ายช่วงปลายปี มอบโปรแรงให้สมาชิกที่เซ็นทรัลและโรบินสันทั่วประเทศ',
  },
  {
    imageUrl: '/assets/images/new-detail-1.png',
    tag: 'รายการทรัพย์สินรอขาย',
    createDate: '15/12/2566',
    description:
      'เคทีซีจับมือมาสเตอร์การ์ดกระตุ้นยอดใช้จ่ายช่วงปลายปี มอบโปรแรงให้สมาชิกที่เซ็นทรัลและโรบินสันทั่วประเทศ',
  },
  {
    imageUrl: '/assets/images/new-detail-1.png',
    tag: 'รายการทรัพย์สินรอขาย',
    createDate: '15/12/2566',
    description:
      'เคทีซีจับมือมาสเตอร์การ์ดกระตุ้นยอดใช้จ่ายช่วงปลายปี มอบโปรแรงให้สมาชิกที่เซ็นทรัลและโรบินสันทั่วประเทศ',
  },
  {
    imageUrl: '/assets/images/new-detail-1.png',
    tag: 'รายการทรัพย์สินรอขาย',
    createDate: '15/12/2566',
    description:
      'เคทีซีจับมือมาสเตอร์การ์ดกระตุ้นยอดใช้จ่ายช่วงปลายปี มอบโปรแรงให้สมาชิกที่เซ็นทรัลและโรบินสันทั่วประเทศ',
  },
];
